{
    "questions": [
        {
            "id": "HQ0004",
            "query_type": "Factoid",
            "question": {
                "string": "Who is responsible for acquisition in the RASH system?"
            },
            "paraphrased_question": [
                "Who collected the data for the RASH system?"
            ],
            "query": {
                "sparql": "SELECT ?acq\nWHERE {\n  orkgr:R8364 orkgp:compareContribution ?cont.\n  ?cont orkgp:P7046 orkgr:R8350.\n  orkgr:R8350 orkgp:P7049 ?acq.\n}"
            },
            "template_id": null,
            "auto_generated": false,
            "query_shape": "chain",
            "query_class": "WHO-WHAT",
            "number_of_patterns": 4
        },
        {
            "id": "HQ0010",
            "query_type": "Non-factoid",
            "question": {
                "string": "What metric will be used to evaluate question answering systems?"
            },
            "paraphrased_question": [
                "With which metric are the question answering systems evaluated?"
            ],
            "query": {
                "sparql": "SELECT DISTINCT ?name\nWHERE {\n  [\n    orkgp:P34 [\n      rdfs:label ?name \n    ]\n  ].\n  FILTER(STRLEN(?name) > 0)\n}\nORDER BY ?name"
            },
            "template_id": null,
            "auto_generated": false,
            "query_shape": "chain",
            "query_class": "WHICH-WHAT",
            "number_of_patterns": 2
        },
        {
            "id": "AQ2434",
            "query_type": "Factoid",
            "question": {
                "string": "Can you provide links to code used in papers that benchmark the ZFNet (1 convnet, 512,1024,512 maps) model?"
            },
            "paraphrased_question": [],
            "query": {
                "sparql": "SELECT DISTINCT ?code\nWHERE {\n  ?model    a            orkgc:Model;\n            rdfs:label    ?model_lbl.\n  FILTER (str(?model_lbl) = \"ZFNet (1 convnet, 512,1024,512 maps)\")\n  ?benchmark      orkgp:HAS_DATASET        ?dataset.\n  ?cont           orkgp:HAS_BENCHMARK      ?benchmark.\n  ?cont           orkgp:HAS_MODEL          ?model;\n                  orkgp:HAS_SOURCE_CODE    ?code.\n}"
            },
            "template_id": "T07",
            "auto_generated": true,
            "query_shape": "Tree",
            "query_class": "WHICH-WHAT",
            "number_of_patterns": 4
        },
        {
            "id": "AQ1007",
            "query_type": "Factoid",
            "question": {
                "string": "Can you list the metrics used to evaluate models on the Flowers-102 dataset?"
            },
            "paraphrased_question": [],
            "query": {
                "sparql": "SELECT DISTINCT ?metric ?metric_lbl\nWHERE {\n  ?dataset       a                orkgc:Dataset;\n                  rdfs:label       ?dataset_lbl.\n  FILTER (str(?dataset_lbl) = \"Flowers-102\")\n  ?benchmark      orkgp:HAS_DATASET       ?dataset;\n                  orkgp:HAS_EVALUATION    ?eval.\n  OPTIONAL {?eval           orkgp:HAS_METRIC         ?metric.\n           ?metric          rdfs:label               ?metric_lbl.}\n}"
            },
            "template_id": "T03",
            "auto_generated": true,
            "query_shape": "Tree",
            "query_class": "WHICH-WHAT",
            "number_of_patterns": 6
        },
        {
            "id": "HQ0015",
            "query_type": "Factoid/Superlative",
            "question": {
                "string": "What is the maximum sample size?"
            },
            "paraphrased_question": [
                "How large is the largest sample size?"
            ],
            "query": {
                "sparql": "SELECT ?sample_size\nWHERE {\n  orkgr:R135371 orkgp:compareContribution ?cont.\n  ?cont orkgp:P15687 ?sample_size\n}\nORDER BY DESC(?sample_size)\nLIMIT 1"
            },
            "template_id": null,
            "auto_generated": false,
            "query_shape": "chain",
            "query_class": "WHICH-WHAT",
            "number_of_patterns": 2
        },
        {
            "id": "AQ0747",
            "query_type": "Factoid",
            "question": {
                "string": "What evaluation metrics are commonly used when benchmarking models on the ChemProt dataset?"
            },
            "paraphrased_question": [],
            "query": {
                "sparql": "SELECT DISTINCT ?metric ?metric_lbl\nWHERE {\n  ?dataset       a                orkgc:Dataset;\n                  rdfs:label       ?dataset_lbl.\n  FILTER (str(?dataset_lbl) = \"ChemProt\")\n  ?benchmark      orkgp:HAS_DATASET       ?dataset;\n                  orkgp:HAS_EVALUATION    ?eval.\n  OPTIONAL {?eval           orkgp:HAS_METRIC         ?metric.\n           ?metric          rdfs:label               ?metric_lbl.}\n}"
            },
            "template_id": "T03",
            "auto_generated": true,
            "query_shape": "Tree",
            "query_class": "WHICH-WHAT",
            "number_of_patterns": 6
        },
        {
            "id": "AQ0862",
            "query_type": "Factoid",
            "question": {
                "string": "What are the metrics of evaluation over the UrbanSound8k dataset?"
            },
            "paraphrased_question": [],
            "query": {
                "sparql": "SELECT DISTINCT ?metric ?metric_lbl\nWHERE {\n  ?dataset       a                orkgc:Dataset;\n                  rdfs:label       ?dataset_lbl.\n  FILTER (str(?dataset_lbl) = \"UrbanSound8k\")\n  ?benchmark      orkgp:HAS_DATASET       ?dataset;\n                  orkgp:HAS_EVALUATION    ?eval.\n  OPTIONAL {?eval           orkgp:HAS_METRIC         ?metric.\n           ?metric          rdfs:label               ?metric_lbl.}\n}"
            },
            "template_id": "T03",
            "auto_generated": true,
            "query_shape": "Tree",
            "query_class": "WHICH-WHAT",
            "number_of_patterns": 6
        },
        {
            "id": "HQ0030",
            "query_type": "Factoid",
            "question": {
                "string": "Which toxins do pseudomonas species produce?"
            },
            "paraphrased_question": [
                "What is the list of the toxins produced by pseudomonas species?"
            ],
            "query": {
                "sparql": "SELECT DISTINCT ?toxins, ?toxins_labels\nWHERE {\n  orkgr:R69027 orkgp:compareContribution ?contrib.\n  ?contrib orkgp:P34037 ?toxins.\n  ?toxins rdfs:label ?toxins_labels.\n}"
            },
            "template_id": null,
            "auto_generated": false,
            "query_shape": "chain",
            "query_class": "WHICH-WHAT",
            "number_of_patterns": 3
        },
        {
            "id": "AQ0038",
            "query_type": "Factoid",
            "question": {
                "string": "What models are being evaluated on the Car speed in Liuliqiao District, Beijing dataset?"
            },
            "paraphrased_question": [],
            "query": {
                "sparql": "SELECT DISTINCT ?model ?model_lbl\nWHERE {\n  ?dataset       a                orkgc:Dataset;\n                  rdfs:label       ?dataset_lbl.\n  FILTER (str(?dataset_lbl) = \"Car speed in Liuliqiao District, Beijing\")\n  ?benchmark      orkgp:HAS_DATASET       ?dataset;\n                  orkgp:HAS_EVALUATION    ?eval.\n  ?paper         orkgp:HAS_BENCHMARK      ?benchmark.\n  OPTIONAL {?paper      orkgp:HAS_MODEL          ?model.\n            ?model      rdfs:label               ?model_lbl.}\n}"
            },
            "template_id": "T01",
            "auto_generated": true,
            "query_shape": "Tree",
            "query_class": "WHICH-WHAT",
            "number_of_patterns": 6
        },
        {
            "id": "AQ2370",
            "query_type": "Factoid",
            "question": {
                "string": "List the code links in papers that use the LeViT-192 model in any benchmark?"
            },
            "paraphrased_question": [],
            "query": {
                "sparql": "SELECT DISTINCT ?code\nWHERE {\n  ?model    a            orkgc:Model;\n            rdfs:label    ?model_lbl.\n  FILTER (str(?model_lbl) = \"LeViT-192\")\n  ?benchmark      orkgp:HAS_DATASET        ?dataset.\n  ?cont           orkgp:HAS_BENCHMARK      ?benchmark.\n  ?cont           orkgp:HAS_MODEL          ?model;\n                  orkgp:HAS_SOURCE_CODE    ?code.\n}"
            },
            "template_id": "T07",
            "auto_generated": true,
            "query_shape": "Tree",
            "query_class": "WHICH-WHAT",
            "number_of_patterns": 4
        },
        {
            "id": "AQ0137",
            "query_type": "Factoid",
            "question": {
                "string": "Can you list the models that have been evaluated on the ARC (Easy) dataset?"
            },
            "paraphrased_question": [],
            "query": {
                "sparql": "SELECT DISTINCT ?model ?model_lbl\nWHERE {\n  ?dataset       a                orkgc:Dataset;\n                  rdfs:label       ?dataset_lbl.\n  FILTER (str(?dataset_lbl) = \"ARC (Easy)\")\n  ?benchmark      orkgp:HAS_DATASET       ?dataset;\n                  orkgp:HAS_EVALUATION    ?eval.\n  ?paper         orkgp:HAS_BENCHMARK      ?benchmark.\n  OPTIONAL {?paper      orkgp:HAS_MODEL          ?model.\n            ?model      rdfs:label               ?model_lbl.}\n}"
            },
            "template_id": "T01",
            "auto_generated": true,
            "query_shape": "Tree",
            "query_class": "WHICH-WHAT",
            "number_of_patterns": 6
        },
        {
            "id": "AQ0596",
            "query_type": "Factoid",
            "question": {
                "string": "Provide a list of research paper titles and IDs that have benchmarked models on the Atari 2600 Kung-Fu Master dataset?"
            },
            "paraphrased_question": [],
            "query": {
                "sparql": "SELECT DISTINCT ?paper ?paper_lbl\nWHERE {\n  ?dataset        a                orkgc:Dataset;\n                  rdfs:label       ?dataset_lbl.\n  FILTER (str(?dataset_lbl) = \"Atari 2600 Kung-Fu Master\")\n  ?benchmark      orkgp:HAS_DATASET       ?dataset.\n  ?cont          orkgp:HAS_BENCHMARK      ?benchmark.\n  ?paper         orkgp:P31                ?cont;\n                 rdfs:label               ?paper_lbl.\n}"
            },
            "template_id": "T02",
            "auto_generated": true,
            "query_shape": "Tree",
            "query_class": "WHICH-WHAT",
            "number_of_patterns": 5
        },
        {
            "id": "AQ2458",
            "query_type": "Factoid",
            "question": {
                "string": "Can you provide links to code used in papers that benchmark the Relationship Types model?"
            },
            "paraphrased_question": [],
            "query": {
                "sparql": "SELECT DISTINCT ?code\nWHERE {\n  ?model    a            orkgc:Model;\n            rdfs:label    ?model_lbl.\n  FILTER (str(?model_lbl) = \"Relationship Types\")\n  ?benchmark      orkgp:HAS_DATASET        ?dataset.\n  ?cont           orkgp:HAS_BENCHMARK      ?benchmark.\n  ?cont           orkgp:HAS_MODEL          ?model;\n                  orkgp:HAS_SOURCE_CODE    ?code.\n}"
            },
            "template_id": "T07",
            "auto_generated": true,
            "query_shape": "Tree",
            "query_class": "WHICH-WHAT",
            "number_of_patterns": 4
        },
        {
            "id": "AQ0192",
            "query_type": "Factoid",
            "question": {
                "string": "Can you list the models that have been evaluated on the Ball in cup, catch (DMControl500k) dataset?"
            },
            "paraphrased_question": [],
            "query": {
                "sparql": "SELECT DISTINCT ?model ?model_lbl\nWHERE {\n  ?dataset       a                orkgc:Dataset;\n                  rdfs:label       ?dataset_lbl.\n  FILTER (str(?dataset_lbl) = \"Ball in cup, catch (DMControl500k)\")\n  ?benchmark      orkgp:HAS_DATASET       ?dataset;\n                  orkgp:HAS_EVALUATION    ?eval.\n  ?paper         orkgp:HAS_BENCHMARK      ?benchmark.\n  OPTIONAL {?paper      orkgp:HAS_MODEL          ?model.\n            ?model      rdfs:label               ?model_lbl.}\n}"
            },
            "template_id": "T01",
            "auto_generated": true,
            "query_shape": "Tree",
            "query_class": "WHICH-WHAT",
            "number_of_patterns": 6
        },
        {
            "id": "AQ0749",
            "query_type": "Factoid",
            "question": {
                "string": "What are the metrics of evaluation over the NYT-single dataset?"
            },
            "paraphrased_question": [],
            "query": {
                "sparql": "SELECT DISTINCT ?metric ?metric_lbl\nWHERE {\n  ?dataset       a                orkgc:Dataset;\n                  rdfs:label       ?dataset_lbl.\n  FILTER (str(?dataset_lbl) = \"NYT-single\")\n  ?benchmark      orkgp:HAS_DATASET       ?dataset;\n                  orkgp:HAS_EVALUATION    ?eval.\n  OPTIONAL {?eval           orkgp:HAS_METRIC         ?metric.\n           ?metric          rdfs:label               ?metric_lbl.}\n}"
            },
            "template_id": "T03",
            "auto_generated": true,
            "query_shape": "Tree",
            "query_class": "WHICH-WHAT",
            "number_of_patterns": 6
        },
        {
            "id": "AQ1080",
            "query_type": "non-factoid",
            "question": {
                "string": "What is the top benchmark score and its metric on the WebNLG dataset?"
            },
            "paraphrased_question": [],
            "query": {
                "sparql": "SELECT DISTINCT ?metric ?metric_lbl (MAX(?value) AS ?score)\nWHERE {\n  {\n    SELECT ?metric ?metric_lbl ?value\n    WHERE {\n      ?dataset       a                orkgc:Dataset;\n                      rdfs:label       ?dataset_lbl.\n      FILTER (str(?dataset_lbl) = \"WebNLG\")\n      ?benchmark      orkgp:HAS_DATASET       ?dataset;\n                      orkgp:HAS_EVALUATION    ?eval.\n      ?eval           orkgp:HAS_VALUE         ?value.\n      OPTIONAL {?eval           orkgp:HAS_METRIC         ?metric.\n               ?metric          rdfs:label               ?metric_lbl.}\n      ?cont         orkgp:HAS_BENCHMARK      ?benchmark.\n      OPTIONAL {?cont      orkgp:HAS_MODEL          ?model.\n                ?model      rdfs:label               ?model_lbl.}\n    }\n    ORDER BY DESC(?value)\n  }\n}\nGROUP BY ?metric ?metric_lbl"
            },
            "template_id": "T04",
            "auto_generated": true,
            "query_shape": "Tree",
            "query_class": "WHICH-WHAT",
            "number_of_patterns": 13
        },
        {
            "id": "HQ0019",
            "query_type": "Factoid/",
            "question": {
                "string": "Does \"PRISMA hyperspectral mission\" use ENVI software?"
            },
            "paraphrased_question": [
                "Does the paper \"paper title\" uses ENVI software?"
            ],
            "query": {
                "sparql": "SELECT ?uses_ENVI\nWHERE {\n  ?papers rdfs:label ?titles.\n  FILTER(REGEX(?titles, \"PRISMA\"))\n  ?papers orkgp:P31 ?cont.\n  ?cont orkgp:P23031 ?software.\n  ?software rdfs:label ?software_labels.\n  BIND(\n    IF(?software_labels = \"ENVI\"^^<http://www.w3.org/2001/XMLSchema#string>, \"Yes\", \"No\") \n    AS ?uses_ENVI\n  )\n}\nORDER BY DESC(?uses_ENVI)\nLIMIT 1"
            },
            "template_id": null,
            "auto_generated": false,
            "query_shape": "tree",
            "query_class": "WHICH-WHAT",
            "number_of_patterns": 4
        },
        {
            "id": "HQ0087",
            "query_type": "Non-factoid/Superlative",
            "question": {
                "string": "When the earliest paper related to X-rays was published? "
            },
            "paraphrased_question": [
                "What is the date of the first paper related to XRays?"
            ],
            "query": {
                "sparql": "SELECT ?publication_years\nWHERE {\n  ?papers rdf:type orkgc:Paper.\n  ?papers rdfs:label ?papers_labels.\n  FILTER(REGEX(?papers_labels, \"X-ray\", \"i\"))\n  ?papers orkgp:P29 ?publication_years. \n}\nORDER BY ASC(?publication_years)\nLIMIT 1"
            },
            "template_id": null,
            "auto_generated": false,
            "query_shape": "star",
            "query_class": "WHAT-WHEN",
            "number_of_patterns": 3
        },
        {
            "id": "HQ0041",
            "query_type": "Factoid",
            "question": {
                "string": "What can one use instead of wheat flour?"
            },
            "paraphrased_question": [
                "What can be used as a substitute for wheat flour in composite bread?"
            ],
            "query": {
                "sparql": "SELECT DISTINCT ?flour\nWHERE {\n  ?_ orkgp:P37571 ?flour.\n}"
            },
            "template_id": null,
            "auto_generated": false,
            "query_shape": "edge",
            "query_class": "WHAT-WHEN",
            "number_of_patterns": 1
        },
        {
            "id": "AQ2104",
            "query_type": "Factoid",
            "question": {
                "string": "List the code links in papers that use the Hierarchical transformer encoder + conditional copy model in any benchmark?"
            },
            "paraphrased_question": [],
            "query": {
                "sparql": "SELECT DISTINCT ?code\nWHERE {\n  ?model    a            orkgc:Model;\n            rdfs:label    ?model_lbl.\n  FILTER (str(?model_lbl) = \"Hierarchical transformer encoder + conditional copy\")\n  ?benchmark      orkgp:HAS_DATASET        ?dataset.\n  ?cont           orkgp:HAS_BENCHMARK      ?benchmark.\n  ?cont           orkgp:HAS_MODEL          ?model;\n                  orkgp:HAS_SOURCE_CODE    ?code.\n}"
            },
            "template_id": "T07",
            "auto_generated": true,
            "query_shape": "Tree",
            "query_class": "WHICH-WHAT",
            "number_of_patterns": 4
        },
        {
            "id": "AQ1731",
            "query_type": "Factoid",
            "question": {
                "string": "What is the best performing model benchmarking the Atari 2600 James Bond dataset in terms of Medium Human-Normalized Score metric?"
            },
            "paraphrased_question": [],
            "query": {
                "sparql": "SELECT DISTINCT ?model ?model_lbl\nWHERE {\n  ?metric     a       orkgc:Metric;\n              rdfs:label  ?metric_lbl.\n  FILTER (str(?metric_lbl) = \"Medium Human-Normalized Score\")\n  {\n    SELECT ?model ?model_lbl\n    WHERE {\n      ?dataset       a                orkgc:Dataset;\n                      rdfs:label       ?dataset_lbl.\n      FILTER (str(?dataset_lbl) = \"Atari 2600 James Bond\")\n      ?benchmark      orkgp:HAS_DATASET       ?dataset;\n                      orkgp:HAS_EVALUATION    ?eval.\n      ?eval           orkgp:HAS_VALUE         ?value;\n                      orkgp:HAS_METRIC         ?metric.\n      ?cont         orkgp:HAS_BENCHMARK      ?benchmark;\n                    orkgp:HAS_MODEL          ?model.\n      ?model      rdfs:label               ?model_lbl.\n    }\n    ORDER BY DESC(?value)\n    LIMIT 1\n  }\n}"
            },
            "template_id": "T05",
            "auto_generated": true,
            "query_shape": "Tree",
            "query_class": "WHICH-WHAT",
            "number_of_patterns": 12
        },
        {
            "id": "AQ0055",
            "query_type": "Factoid",
            "question": {
                "string": "Can you list the models that have been evaluated on the JNLPBA dataset?"
            },
            "paraphrased_question": [],
            "query": {
                "sparql": "SELECT DISTINCT ?model ?model_lbl\nWHERE {\n  ?dataset       a                orkgc:Dataset;\n                  rdfs:label       ?dataset_lbl.\n  FILTER (str(?dataset_lbl) = \"JNLPBA\")\n  ?benchmark      orkgp:HAS_DATASET       ?dataset;\n                  orkgp:HAS_EVALUATION    ?eval.\n  ?paper         orkgp:HAS_BENCHMARK      ?benchmark.\n  OPTIONAL {?paper      orkgp:HAS_MODEL          ?model.\n            ?model      rdfs:label               ?model_lbl.}\n}"
            },
            "template_id": "T01",
            "auto_generated": true,
            "query_shape": "Tree",
            "query_class": "WHICH-WHAT",
            "number_of_patterns": 6
        },
        {
            "id": "AQ0028",
            "query_type": "Factoid",
            "question": {
                "string": "What are the models that have been benchmarked on the CS-NER dataset?"
            },
            "paraphrased_question": [],
            "query": {
                "sparql": "SELECT DISTINCT ?model ?model_lbl\nWHERE {\n  ?dataset       a                orkgc:Dataset;\n                  rdfs:label       ?dataset_lbl.\n  FILTER (str(?dataset_lbl) = \"CS-NER\")\n  ?benchmark      orkgp:HAS_DATASET       ?dataset;\n                  orkgp:HAS_EVALUATION    ?eval.\n  ?paper         orkgp:HAS_BENCHMARK      ?benchmark.\n  OPTIONAL {?paper      orkgp:HAS_MODEL          ?model.\n            ?model      rdfs:label               ?model_lbl.}\n}"
            },
            "template_id": "T01",
            "auto_generated": true,
            "query_shape": "Tree",
            "query_class": "WHICH-WHAT",
            "number_of_patterns": 6
        },
        {
            "id": "AQ1479",
            "query_type": "Factoid",
            "question": {
                "string": "What is the best performing model benchmarking the CNN / Daily Mail dataset in terms of ROUGE-1 metric?"
            },
            "paraphrased_question": [],
            "query": {
                "sparql": "SELECT DISTINCT ?model ?model_lbl\nWHERE {\n  ?metric     a       orkgc:Metric;\n              rdfs:label  ?metric_lbl.\n  FILTER (str(?metric_lbl) = \"ROUGE-1\")\n  {\n    SELECT ?model ?model_lbl\n    WHERE {\n      ?dataset       a                orkgc:Dataset;\n                      rdfs:label       ?dataset_lbl.\n      FILTER (str(?dataset_lbl) = \"CNN / Daily Mail\")\n      ?benchmark      orkgp:HAS_DATASET       ?dataset;\n                      orkgp:HAS_EVALUATION    ?eval.\n      ?eval           orkgp:HAS_VALUE         ?value;\n                      orkgp:HAS_METRIC         ?metric.\n      ?cont         orkgp:HAS_BENCHMARK      ?benchmark;\n                    orkgp:HAS_MODEL          ?model.\n      ?model      rdfs:label               ?model_lbl.\n    }\n    ORDER BY DESC(?value)\n    LIMIT 1\n  }\n}"
            },
            "template_id": "T05",
            "auto_generated": true,
            "query_shape": "Tree",
            "query_class": "WHICH-WHAT",
            "number_of_patterns": 12
        },
        {
            "id": "AQ2036",
            "query_type": "Factoid",
            "question": {
                "string": "List the code links in papers that use the Transformer Base + adversarial MLE model in any benchmark?"
            },
            "paraphrased_question": [],
            "query": {
                "sparql": "SELECT DISTINCT ?code\nWHERE {\n  ?model    a            orkgc:Model;\n            rdfs:label    ?model_lbl.\n  FILTER (str(?model_lbl) = \"Transformer Base + adversarial MLE\")\n  ?benchmark      orkgp:HAS_DATASET        ?dataset.\n  ?cont           orkgp:HAS_BENCHMARK      ?benchmark.\n  ?cont           orkgp:HAS_MODEL          ?model;\n                  orkgp:HAS_SOURCE_CODE    ?code.\n}"
            },
            "template_id": "T07",
            "auto_generated": true,
            "query_shape": "Tree",
            "query_class": "WHICH-WHAT",
            "number_of_patterns": 4
        },
        {
            "id": "AQ0873",
            "query_type": "Factoid",
            "question": {
                "string": "What are the metrics of evaluation over the BC5CDR-disease dataset?"
            },
            "paraphrased_question": [],
            "query": {
                "sparql": "SELECT DISTINCT ?metric ?metric_lbl\nWHERE {\n  ?dataset       a                orkgc:Dataset;\n                  rdfs:label       ?dataset_lbl.\n  FILTER (str(?dataset_lbl) = \"BC5CDR-disease\")\n  ?benchmark      orkgp:HAS_DATASET       ?dataset;\n                  orkgp:HAS_EVALUATION    ?eval.\n  OPTIONAL {?eval           orkgp:HAS_METRIC         ?metric.\n           ?metric          rdfs:label               ?metric_lbl.}\n}"
            },
            "template_id": "T03",
            "auto_generated": true,
            "query_shape": "Tree",
            "query_class": "WHICH-WHAT",
            "number_of_patterns": 6
        },
        {
            "id": "AQ0381",
            "query_type": "Factoid",
            "question": {
                "string": "What are the titles and IDs of research papers that include a benchmark for the Car speed in Liuliqiao District, Beijing dataset?"
            },
            "paraphrased_question": [],
            "query": {
                "sparql": "SELECT DISTINCT ?paper ?paper_lbl\nWHERE {\n  ?dataset        a                orkgc:Dataset;\n                  rdfs:label       ?dataset_lbl.\n  FILTER (str(?dataset_lbl) = \"Car speed in Liuliqiao District, Beijing\")\n  ?benchmark      orkgp:HAS_DATASET       ?dataset.\n  ?cont          orkgp:HAS_BENCHMARK      ?benchmark.\n  ?paper         orkgp:P31                ?cont;\n                 rdfs:label               ?paper_lbl.\n}"
            },
            "template_id": "T02",
            "auto_generated": true,
            "query_shape": "Tree",
            "query_class": "WHICH-WHAT",
            "number_of_patterns": 5
        },
        {
            "id": "AQ2076",
            "query_type": "Factoid",
            "question": {
                "string": "Provide a list of papers that have utilized the Reading Twice for NLU model and include the links to their code?"
            },
            "paraphrased_question": [],
            "query": {
                "sparql": "SELECT DISTINCT ?code\nWHERE {\n  ?model    a            orkgc:Model;\n            rdfs:label    ?model_lbl.\n  FILTER (str(?model_lbl) = \"Reading Twice for NLU\")\n  ?benchmark      orkgp:HAS_DATASET        ?dataset.\n  ?cont           orkgp:HAS_BENCHMARK      ?benchmark.\n  ?cont           orkgp:HAS_MODEL          ?model;\n                  orkgp:HAS_SOURCE_CODE    ?code.\n}"
            },
            "template_id": "T07",
            "auto_generated": true,
            "query_shape": "Tree",
            "query_class": "WHICH-WHAT",
            "number_of_patterns": 4
        },
        {
            "id": "HQ0033",
            "query_type": "Non-factoid",
            "question": {
                "string": "What risk factors for OSA are discovered in the paper with 100% OSA frequency?  "
            },
            "paraphrased_question": [
                "What is the list of risk factors for obstuctive sleep apnea mentioned in papers with a 100% OSA ferquency?"
            ],
            "query": {
                "sparql": "SELECT ?risk_factors, ?risk_factors_labels\nWHERE {\n  orkgr:R110932 orkgp:compareContribution ?contrib.\n  ?contrib orkgp:P37530 ?osa_frequency.\n  ?osa_frequency rdfs:label ?osa_frequency_values.\n  ?contrib orkgp:P37528 ?risk_factors.\n  ?risk_factors rdfs:label ?risk_factors_labels.\n  FILTER(REGEX(?osa_frequency_values, \"100\"^^xsd:string))\n}"
            },
            "template_id": null,
            "auto_generated": false,
            "query_shape": "tree",
            "query_class": "WHICH-WHAT",
            "number_of_patterns": 5
        },
        {
            "id": "AQ0158",
            "query_type": "Factoid",
            "question": {
                "string": "What models are being evaluated on the Text8 dataset?"
            },
            "paraphrased_question": [],
            "query": {
                "sparql": "SELECT DISTINCT ?model ?model_lbl\nWHERE {\n  ?dataset       a                orkgc:Dataset;\n                  rdfs:label       ?dataset_lbl.\n  FILTER (str(?dataset_lbl) = \"Text8\")\n  ?benchmark      orkgp:HAS_DATASET       ?dataset;\n                  orkgp:HAS_EVALUATION    ?eval.\n  ?paper         orkgp:HAS_BENCHMARK      ?benchmark.\n  OPTIONAL {?paper      orkgp:HAS_MODEL          ?model.\n            ?model      rdfs:label               ?model_lbl.}\n}"
            },
            "template_id": "T01",
            "auto_generated": true,
            "query_shape": "Tree",
            "query_class": "WHICH-WHAT",
            "number_of_patterns": 6
        },
        {
            "id": "AQ1470",
            "query_type": "Factoid",
            "question": {
                "string": "Indicate the model that performed best in terms of F1 metric on the Quora Question Pairs benchmark dataset?"
            },
            "paraphrased_question": [],
            "query": {
                "sparql": "SELECT DISTINCT ?model ?model_lbl\nWHERE {\n  ?metric     a       orkgc:Metric;\n              rdfs:label  ?metric_lbl.\n  FILTER (str(?metric_lbl) = \"F1\")\n  {\n    SELECT ?model ?model_lbl\n    WHERE {\n      ?dataset       a                orkgc:Dataset;\n                      rdfs:label       ?dataset_lbl.\n      FILTER (str(?dataset_lbl) = \"Quora Question Pairs\")\n      ?benchmark      orkgp:HAS_DATASET       ?dataset;\n                      orkgp:HAS_EVALUATION    ?eval.\n      ?eval           orkgp:HAS_VALUE         ?value;\n                      orkgp:HAS_METRIC         ?metric.\n      ?cont         orkgp:HAS_BENCHMARK      ?benchmark;\n                    orkgp:HAS_MODEL          ?model.\n      ?model      rdfs:label               ?model_lbl.\n    }\n    ORDER BY DESC(?value)\n    LIMIT 1\n  }\n}"
            },
            "template_id": "T05",
            "auto_generated": true,
            "query_shape": "Tree",
            "query_class": "WHICH-WHAT",
            "number_of_patterns": 12
        },
        {
            "id": "HQ0060",
            "query_type": "Non-factoid",
            "question": {
                "string": "What are economics subfields?"
            },
            "paraphrased_question": [
                "Which are the subfields of Economics research field?"
            ],
            "query": {
                "sparql": "SELECT DISTINCT ?subfields, ?subfields_labels\nWHERE {\n  ?papers orkgp:P30 ?research_fields.\n  ?research_fields rdfs:label \"Economics\"^^xsd:string.\n  ?research_fields orkgp:P36 ?subfields.\n  ?subfields rdfs:label ?subfields_labels. \n}"
            },
            "template_id": null,
            "auto_generated": false,
            "query_shape": "chain",
            "query_class": "WHICH-WHAT",
            "number_of_patterns": 4
        },
        {
            "id": "AQ2141",
            "query_type": "Factoid",
            "question": {
                "string": "List the code links in papers that use the 64-layer Character Transformer Model model in any benchmark?"
            },
            "paraphrased_question": [],
            "query": {
                "sparql": "SELECT DISTINCT ?code\nWHERE {\n  ?model    a            orkgc:Model;\n            rdfs:label    ?model_lbl.\n  FILTER (str(?model_lbl) = \"64-layer Character Transformer Model\")\n  ?benchmark      orkgp:HAS_DATASET        ?dataset.\n  ?cont           orkgp:HAS_BENCHMARK      ?benchmark.\n  ?cont           orkgp:HAS_MODEL          ?model;\n                  orkgp:HAS_SOURCE_CODE    ?code.\n}"
            },
            "template_id": "T07",
            "auto_generated": true,
            "query_shape": "Tree",
            "query_class": "WHICH-WHAT",
            "number_of_patterns": 4
        }
    ]
}