{
    "questions": [
        {
            "id": "AQ1550",
            "query_type": "Factoid",
            "question": {
                "string": "What is the best performing model benchmarking the SentEval dataset in terms of STS metric?"
            },
            "paraphrased_question": [],
            "query": {
                "sparql": "SELECT DISTINCT ?model ?model_lbl\nWHERE {\n  ?metric     a       orkgc:Metric;\n              rdfs:label  ?metric_lbl.\n  FILTER (str(?metric_lbl) = \"STS\")\n  {\n    SELECT ?model ?model_lbl\n    WHERE {\n      ?dataset       a                orkgc:Dataset;\n                      rdfs:label       ?dataset_lbl.\n      FILTER (str(?dataset_lbl) = \"SentEval\")\n      ?benchmark      orkgp:HAS_DATASET       ?dataset;\n                      orkgp:HAS_EVALUATION    ?eval.\n      ?eval           orkgp:HAS_VALUE         ?value;\n                      orkgp:HAS_METRIC         ?metric.\n      ?cont         orkgp:HAS_BENCHMARK      ?benchmark;\n                    orkgp:HAS_MODEL          ?model.\n      ?model      rdfs:label               ?model_lbl.\n    }\n    ORDER BY DESC(?value)\n    LIMIT 1\n  }\n}"
            },
            "template_id": "T05",
            "auto_generated": true,
            "query_shape": "Tree",
            "query_class": "WHICH-WHAT",
            "number_of_patterns": 12
        },
        {
            "id": "AQ1066",
            "query_type": "non-factoid",
            "question": {
                "string": "What is the top benchmark result (metric and value) over the dataset smallNLP-KG?"
            },
            "paraphrased_question": [],
            "query": {
                "sparql": "SELECT DISTINCT ?metric ?metric_lbl (MAX(?value) AS ?score)\nWHERE {\n  {\n    SELECT ?metric ?metric_lbl ?value\n    WHERE {\n      ?dataset       a                orkgc:Dataset;\n                      rdfs:label       ?dataset_lbl.\n      FILTER (str(?dataset_lbl) = \"smallNLP-KG\")\n      ?benchmark      orkgp:HAS_DATASET       ?dataset;\n                      orkgp:HAS_EVALUATION    ?eval.\n      ?eval           orkgp:HAS_VALUE         ?value.\n      OPTIONAL {?eval           orkgp:HAS_METRIC         ?metric.\n               ?metric          rdfs:label               ?metric_lbl.}\n      ?cont         orkgp:HAS_BENCHMARK      ?benchmark.\n      OPTIONAL {?cont      orkgp:HAS_MODEL          ?model.\n                ?model      rdfs:label               ?model_lbl.}\n    }\n    ORDER BY DESC(?value)\n  }\n}\nGROUP BY ?metric ?metric_lbl"
            },
            "template_id": "T04",
            "auto_generated": true,
            "query_shape": "Tree",
            "query_class": "WHICH-WHAT",
            "number_of_patterns": 13
        },
        {
            "id": "AQ2247",
            "query_type": "Factoid",
            "question": {
                "string": "List the code links in papers that use the OccupancyAnticipation model in any benchmark?"
            },
            "paraphrased_question": [],
            "query": {
                "sparql": "SELECT DISTINCT ?code\nWHERE {\n  ?model    a            orkgc:Model;\n            rdfs:label    ?model_lbl.\n  FILTER (str(?model_lbl) = \"OccupancyAnticipation\")\n  ?benchmark      orkgp:HAS_DATASET        ?dataset.\n  ?cont           orkgp:HAS_BENCHMARK      ?benchmark.\n  ?cont           orkgp:HAS_MODEL          ?model;\n                  orkgp:HAS_SOURCE_CODE    ?code.\n}"
            },
            "template_id": "T07",
            "auto_generated": true,
            "query_shape": "Tree",
            "query_class": "WHICH-WHAT",
            "number_of_patterns": 4
        },
        {
            "id": "AQ0320",
            "query_type": "Factoid",
            "question": {
                "string": "Can you list the models that have been evaluated on the SVHN dataset?"
            },
            "paraphrased_question": [],
            "query": {
                "sparql": "SELECT DISTINCT ?model ?model_lbl\nWHERE {\n  ?dataset       a                orkgc:Dataset;\n                  rdfs:label       ?dataset_lbl.\n  FILTER (str(?dataset_lbl) = \"SVHN\")\n  ?benchmark      orkgp:HAS_DATASET       ?dataset;\n                  orkgp:HAS_EVALUATION    ?eval.\n  ?paper         orkgp:HAS_BENCHMARK      ?benchmark.\n  OPTIONAL {?paper      orkgp:HAS_MODEL          ?model.\n            ?model      rdfs:label               ?model_lbl.}\n}"
            },
            "template_id": "T01",
            "auto_generated": true,
            "query_shape": "Tree",
            "query_class": "WHICH-WHAT",
            "number_of_patterns": 6
        },
        {
            "id": "AQ2263",
            "query_type": "Factoid",
            "question": {
                "string": "Where can I find code references in papers that have used the XLMft UDA model for benchmarking purposes?"
            },
            "paraphrased_question": [],
            "query": {
                "sparql": "SELECT DISTINCT ?code\nWHERE {\n  ?model    a            orkgc:Model;\n            rdfs:label    ?model_lbl.\n  FILTER (str(?model_lbl) = \"XLMft UDA\")\n  ?benchmark      orkgp:HAS_DATASET        ?dataset.\n  ?cont           orkgp:HAS_BENCHMARK      ?benchmark.\n  ?cont           orkgp:HAS_MODEL          ?model;\n                  orkgp:HAS_SOURCE_CODE    ?code.\n}"
            },
            "template_id": "T07",
            "auto_generated": true,
            "query_shape": "Tree",
            "query_class": "WHICH-WHAT",
            "number_of_patterns": 4
        },
        {
            "id": "HQ0093",
            "query_type": "Non-factoid",
            "question": {
                "string": "What are the research problems of the cultural history field?"
            },
            "paraphrased_question": [
                "What are the research challenges in the domain of Cultural History?"
            ],
            "query": {
                "sparql": "SELECT DISTINCT ?research_problems, ?research_problems_labels\nWHERE {\n  ?papers rdf:type orkgc:Paper.\n  ?papers orkgp:P30 ?research_fields.\n  ?research_fields rdfs:label ?research_fields_labels. \n  FILTER(REGEX(?research_fields_labels, \"cultural history\", \"i\"))\n  ?papers orkgp:P31 ?contrib.\n  ?contrib orkgp:P32 ?research_problems.\n  ?research_problems rdfs:label ?research_problems_labels.\n}"
            },
            "template_id": null,
            "auto_generated": false,
            "query_shape": "tree",
            "query_class": "WHICH-WHAT",
            "number_of_patterns": 6
        },
        {
            "id": "HQ0094",
            "query_type": "Non-factoid",
            "question": {
                "string": "Who are the co-authors of Kurt Thomas?"
            },
            "paraphrased_question": [
                "Who are the authors that Kurt Thomas has written research papers with?"
            ],
            "query": {
                "sparql": "SELECT ?co_authors\nWHERE {\n  ?papers rdf:type orkgc:Paper.\n  ?papers orkgp:P27 ?authors.\n  FILTER(REGEX(?authors, \"Kurt Thomas\"))\n  ?papers orkgp:P27 ?co_authors.\n  FILTER(?co_authors != \"Kurt Thomas\"^^xsd:string)\n}"
            },
            "template_id": null,
            "auto_generated": false,
            "query_shape": "star",
            "query_class": "WHAT-WHO",
            "number_of_patterns": 3
        },
        {
            "id": "AQ0116",
            "query_type": "Factoid",
            "question": {
                "string": "What models are being evaluated on the SQuAD1.1 dev dataset?"
            },
            "paraphrased_question": [],
            "query": {
                "sparql": "SELECT DISTINCT ?model ?model_lbl\nWHERE {\n  ?dataset       a                orkgc:Dataset;\n                  rdfs:label       ?dataset_lbl.\n  FILTER (str(?dataset_lbl) = \"SQuAD1.1 dev\")\n  ?benchmark      orkgp:HAS_DATASET       ?dataset;\n                  orkgp:HAS_EVALUATION    ?eval.\n  ?paper         orkgp:HAS_BENCHMARK      ?benchmark.\n  OPTIONAL {?paper      orkgp:HAS_MODEL          ?model.\n            ?model      rdfs:label               ?model_lbl.}\n}"
            },
            "template_id": "T01",
            "auto_generated": true,
            "query_shape": "Tree",
            "query_class": "WHICH-WHAT",
            "number_of_patterns": 6
        },
        {
            "id": "AQ2030",
            "query_type": "Factoid",
            "question": {
                "string": "Can you provide links to code used in papers that benchmark the Denoising autoencoders (non-autoregressive) model?"
            },
            "paraphrased_question": [],
            "query": {
                "sparql": "SELECT DISTINCT ?code\nWHERE {\n  ?model    a            orkgc:Model;\n            rdfs:label    ?model_lbl.\n  FILTER (str(?model_lbl) = \"Denoising autoencoders (non-autoregressive)\")\n  ?benchmark      orkgp:HAS_DATASET        ?dataset.\n  ?cont           orkgp:HAS_BENCHMARK      ?benchmark.\n  ?cont           orkgp:HAS_MODEL          ?model;\n                  orkgp:HAS_SOURCE_CODE    ?code.\n}"
            },
            "template_id": "T07",
            "auto_generated": true,
            "query_shape": "Tree",
            "query_class": "WHICH-WHAT",
            "number_of_patterns": 4
        },
        {
            "id": "HQ0025",
            "query_type": "Factoid",
            "question": {
                "string": "Which scholarly knowledge graphs support RDF?"
            },
            "paraphrased_question": [
                " Which graphs have RDF support?",
                " What is the list of all graphs which are compatible with RDF?",
                " Which graphs are able to work with RDF?"
            ],
            "query": {
                "sparql": "SELECT ?title\nWHERE {\n  orkgr:R78023 orkgp:compareContribution ?cont.\n  ?cont orkgp:P7009 ?has_rdf.\n  FILTER(REGEX(?has_rdf, \"T\"))\n  ?cont rdfs:label ?title\n}"
            },
            "template_id": null,
            "auto_generated": false,
            "query_shape": "tree",
            "query_class": "WHICH-WHAT",
            "number_of_patterns": 3
        },
        {
            "id": "HQ0029",
            "query_type": "Factoid/Temporal/Count",
            "question": {
                "string": "How many studies are published after 2019?"
            },
            "paraphrased_question": [
                "What is the number of published studies from 2019 onwords?"
            ],
            "query": {
                "sparql": "SELECT (COUNT(?date) AS ?number_of_studies)\nWHERE {\n  orkgr:R110393 orkgp:compareContribution ?contrib.\n  ?contrib orkgp:P9040 ?date.\n  filter(?date > \"2019\"^^xsd:string)\n}"
            },
            "template_id": null,
            "auto_generated": false,
            "query_shape": "chain",
            "query_class": "WHICH-WHAT",
            "number_of_patterns": 2
        },
        {
            "id": "AQ1278",
            "query_type": "non-factoid",
            "question": {
                "string": "What is the top benchmark score and its metric on the Atari 2600 Demon Attack dataset?"
            },
            "paraphrased_question": [],
            "query": {
                "sparql": "SELECT DISTINCT ?metric ?metric_lbl (MAX(?value) AS ?score)\nWHERE {\n  {\n    SELECT ?metric ?metric_lbl ?value\n    WHERE {\n      ?dataset       a                orkgc:Dataset;\n                      rdfs:label       ?dataset_lbl.\n      FILTER (str(?dataset_lbl) = \"Atari 2600 Demon Attack\")\n      ?benchmark      orkgp:HAS_DATASET       ?dataset;\n                      orkgp:HAS_EVALUATION    ?eval.\n      ?eval           orkgp:HAS_VALUE         ?value.\n      OPTIONAL {?eval           orkgp:HAS_METRIC         ?metric.\n               ?metric          rdfs:label               ?metric_lbl.}\n      ?cont         orkgp:HAS_BENCHMARK      ?benchmark.\n      OPTIONAL {?cont      orkgp:HAS_MODEL          ?model.\n                ?model      rdfs:label               ?model_lbl.}\n    }\n    ORDER BY DESC(?value)\n  }\n}\nGROUP BY ?metric ?metric_lbl"
            },
            "template_id": "T04",
            "auto_generated": true,
            "query_shape": "Tree",
            "query_class": "WHICH-WHAT",
            "number_of_patterns": 13
        },
        {
            "id": "AQ2122",
            "query_type": "Factoid",
            "question": {
                "string": "Provide a list of papers that have utilized the Longformer (12 layers, h=512) model and include the links to their code?"
            },
            "paraphrased_question": [],
            "query": {
                "sparql": "SELECT DISTINCT ?code\nWHERE {\n  ?model    a            orkgc:Model;\n            rdfs:label    ?model_lbl.\n  FILTER (str(?model_lbl) = \"Longformer (12 layers, h=512)\")\n  ?benchmark      orkgp:HAS_DATASET        ?dataset.\n  ?cont           orkgp:HAS_BENCHMARK      ?benchmark.\n  ?cont           orkgp:HAS_MODEL          ?model;\n                  orkgp:HAS_SOURCE_CODE    ?code.\n}"
            },
            "template_id": "T07",
            "auto_generated": true,
            "query_shape": "Tree",
            "query_class": "WHICH-WHAT",
            "number_of_patterns": 4
        },
        {
            "id": "AQ2048",
            "query_type": "Factoid",
            "question": {
                "string": "Where can I find code references in papers that have used the AVID model for benchmarking purposes?"
            },
            "paraphrased_question": [],
            "query": {
                "sparql": "SELECT DISTINCT ?code\nWHERE {\n  ?model    a            orkgc:Model;\n            rdfs:label    ?model_lbl.\n  FILTER (str(?model_lbl) = \"AVID\")\n  ?benchmark      orkgp:HAS_DATASET        ?dataset.\n  ?cont           orkgp:HAS_BENCHMARK      ?benchmark.\n  ?cont           orkgp:HAS_MODEL          ?model;\n                  orkgp:HAS_SOURCE_CODE    ?code.\n}"
            },
            "template_id": "T07",
            "auto_generated": true,
            "query_shape": "Tree",
            "query_class": "WHICH-WHAT",
            "number_of_patterns": 4
        },
        {
            "id": "AQ0295",
            "query_type": "Factoid",
            "question": {
                "string": "What are the models that have been benchmarked on the TREC-6 dataset?"
            },
            "paraphrased_question": [],
            "query": {
                "sparql": "SELECT DISTINCT ?model ?model_lbl\nWHERE {\n  ?dataset       a                orkgc:Dataset;\n                  rdfs:label       ?dataset_lbl.\n  FILTER (str(?dataset_lbl) = \"TREC-6\")\n  ?benchmark      orkgp:HAS_DATASET       ?dataset;\n                  orkgp:HAS_EVALUATION    ?eval.\n  ?paper         orkgp:HAS_BENCHMARK      ?benchmark.\n  OPTIONAL {?paper      orkgp:HAS_MODEL          ?model.\n            ?model      rdfs:label               ?model_lbl.}\n}"
            },
            "template_id": "T01",
            "auto_generated": true,
            "query_shape": "Tree",
            "query_class": "WHICH-WHAT",
            "number_of_patterns": 6
        },
        {
            "id": "AQ2270",
            "query_type": "Factoid",
            "question": {
                "string": "Where can I find code references in papers that have used the Universal Sentence Encoder model for benchmarking purposes?"
            },
            "paraphrased_question": [],
            "query": {
                "sparql": "SELECT DISTINCT ?code\nWHERE {\n  ?model    a            orkgc:Model;\n            rdfs:label    ?model_lbl.\n  FILTER (str(?model_lbl) = \"Universal Sentence Encoder\")\n  ?benchmark      orkgp:HAS_DATASET        ?dataset.\n  ?cont           orkgp:HAS_BENCHMARK      ?benchmark.\n  ?cont           orkgp:HAS_MODEL          ?model;\n                  orkgp:HAS_SOURCE_CODE    ?code.\n}"
            },
            "template_id": "T07",
            "auto_generated": true,
            "query_shape": "Tree",
            "query_class": "WHICH-WHAT",
            "number_of_patterns": 4
        },
        {
            "id": "AQ1371",
            "query_type": "non-factoid",
            "question": {
                "string": "What is the highest benchmark result achieved on the Open Entity dataset, including the metric and its value?"
            },
            "paraphrased_question": [],
            "query": {
                "sparql": "SELECT DISTINCT ?metric ?metric_lbl (MAX(?value) AS ?score)\nWHERE {\n  {\n    SELECT ?metric ?metric_lbl ?value\n    WHERE {\n      ?dataset       a                orkgc:Dataset;\n                      rdfs:label       ?dataset_lbl.\n      FILTER (str(?dataset_lbl) = \"Open Entity\")\n      ?benchmark      orkgp:HAS_DATASET       ?dataset;\n                      orkgp:HAS_EVALUATION    ?eval.\n      ?eval           orkgp:HAS_VALUE         ?value.\n      OPTIONAL {?eval           orkgp:HAS_METRIC         ?metric.\n               ?metric          rdfs:label               ?metric_lbl.}\n      ?cont         orkgp:HAS_BENCHMARK      ?benchmark.\n      OPTIONAL {?cont      orkgp:HAS_MODEL          ?model.\n                ?model      rdfs:label               ?model_lbl.}\n    }\n    ORDER BY DESC(?value)\n  }\n}\nGROUP BY ?metric ?metric_lbl"
            },
            "template_id": "T04",
            "auto_generated": true,
            "query_shape": "Tree",
            "query_class": "WHICH-WHAT",
            "number_of_patterns": 13
        },
        {
            "id": "AQ0877",
            "query_type": "Factoid",
            "question": {
                "string": "Can you list the metrics used to evaluate models on the Finger, spin (DMControl100k) dataset?"
            },
            "paraphrased_question": [],
            "query": {
                "sparql": "SELECT DISTINCT ?metric ?metric_lbl\nWHERE {\n  ?dataset       a                orkgc:Dataset;\n                  rdfs:label       ?dataset_lbl.\n  FILTER (str(?dataset_lbl) = \"Finger, spin (DMControl100k)\")\n  ?benchmark      orkgp:HAS_DATASET       ?dataset;\n                  orkgp:HAS_EVALUATION    ?eval.\n  OPTIONAL {?eval           orkgp:HAS_METRIC         ?metric.\n           ?metric          rdfs:label               ?metric_lbl.}\n}"
            },
            "template_id": "T03",
            "auto_generated": true,
            "query_shape": "Tree",
            "query_class": "WHICH-WHAT",
            "number_of_patterns": 6
        },
        {
            "id": "HQ0059",
            "query_type": "Non-factoid/Superlative",
            "question": {
                "string": "Which are five the most common research fields for papers?"
            },
            "paraphrased_question": [
                "What are the top five used research fields in papers?"
            ],
            "query": {
                "sparql": "SELECT ?research_field, ?research_field_labels\nWHERE {\n  ?papers orkgp:P30 ?research_field.\n  ?research_field rdfs:label ?research_field_labels.\n}\nORDER BY DESC(COUNT(?research_field_labels))\nLIMIT 5"
            },
            "template_id": null,
            "auto_generated": false,
            "query_shape": "chain",
            "query_class": "WHICH-WHAT",
            "number_of_patterns": 2
        },
        {
            "id": "AQ2116",
            "query_type": "Factoid",
            "question": {
                "string": "Where can I find code references in papers that have used the Compressive Transformer (24 layers) model for benchmarking purposes?"
            },
            "paraphrased_question": [],
            "query": {
                "sparql": "SELECT DISTINCT ?code\nWHERE {\n  ?model    a            orkgc:Model;\n            rdfs:label    ?model_lbl.\n  FILTER (str(?model_lbl) = \"Compressive Transformer (24 layers)\")\n  ?benchmark      orkgp:HAS_DATASET        ?dataset.\n  ?cont           orkgp:HAS_BENCHMARK      ?benchmark.\n  ?cont           orkgp:HAS_MODEL          ?model;\n                  orkgp:HAS_SOURCE_CODE    ?code.\n}"
            },
            "template_id": "T07",
            "auto_generated": true,
            "query_shape": "Tree",
            "query_class": "WHICH-WHAT",
            "number_of_patterns": 4
        },
        {
            "id": "HQ0044",
            "query_type": "Factoid/Count",
            "question": {
                "string": "What is the total number of species examined in the studies?"
            },
            "paraphrased_question": [
                "How many species are examined throughout the papers?"
            ],
            "query": {
                "sparql": "SELECT (SUM(?number) AS ?total)\nWHERE {\n  orkgr:R58002 orkgp:compareContribution ?contrib.\n  ?contrib orkgp:P31024 ?number_of_species.\n  BIND(xsd:integer(?number_of_species) AS ?number)\n}"
            },
            "template_id": null,
            "auto_generated": false,
            "query_shape": "chain",
            "query_class": "WHICH-WHAT",
            "number_of_patterns": 2
        },
        {
            "id": "AQ1170",
            "query_type": "non-factoid",
            "question": {
                "string": "What is the top benchmark score and its metric on the RTE dataset?"
            },
            "paraphrased_question": [],
            "query": {
                "sparql": "SELECT DISTINCT ?metric ?metric_lbl (MAX(?value) AS ?score)\nWHERE {\n  {\n    SELECT ?metric ?metric_lbl ?value\n    WHERE {\n      ?dataset       a                orkgc:Dataset;\n                      rdfs:label       ?dataset_lbl.\n      FILTER (str(?dataset_lbl) = \"RTE\")\n      ?benchmark      orkgp:HAS_DATASET       ?dataset;\n                      orkgp:HAS_EVALUATION    ?eval.\n      ?eval           orkgp:HAS_VALUE         ?value.\n      OPTIONAL {?eval           orkgp:HAS_METRIC         ?metric.\n               ?metric          rdfs:label               ?metric_lbl.}\n      ?cont         orkgp:HAS_BENCHMARK      ?benchmark.\n      OPTIONAL {?cont      orkgp:HAS_MODEL          ?model.\n                ?model      rdfs:label               ?model_lbl.}\n    }\n    ORDER BY DESC(?value)\n  }\n}\nGROUP BY ?metric ?metric_lbl"
            },
            "template_id": "T04",
            "auto_generated": true,
            "query_shape": "Tree",
            "query_class": "WHICH-WHAT",
            "number_of_patterns": 13
        },
        {
            "id": "AQ0827",
            "query_type": "Factoid",
            "question": {
                "string": "Can you list the metrics used to evaluate models on the RTE dataset?"
            },
            "paraphrased_question": [],
            "query": {
                "sparql": "SELECT DISTINCT ?metric ?metric_lbl\nWHERE {\n  ?dataset       a                orkgc:Dataset;\n                  rdfs:label       ?dataset_lbl.\n  FILTER (str(?dataset_lbl) = \"RTE\")\n  ?benchmark      orkgp:HAS_DATASET       ?dataset;\n                  orkgp:HAS_EVALUATION    ?eval.\n  OPTIONAL {?eval           orkgp:HAS_METRIC         ?metric.\n           ?metric          rdfs:label               ?metric_lbl.}\n}"
            },
            "template_id": "T03",
            "auto_generated": true,
            "query_shape": "Tree",
            "query_class": "WHICH-WHAT",
            "number_of_patterns": 6
        },
        {
            "id": "AQ0126",
            "query_type": "Factoid",
            "question": {
                "string": "What models are being evaluated on the Natural Questions (long) dataset?"
            },
            "paraphrased_question": [],
            "query": {
                "sparql": "SELECT DISTINCT ?model ?model_lbl\nWHERE {\n  ?dataset       a                orkgc:Dataset;\n                  rdfs:label       ?dataset_lbl.\n  FILTER (str(?dataset_lbl) = \"Natural Questions (long)\")\n  ?benchmark      orkgp:HAS_DATASET       ?dataset;\n                  orkgp:HAS_EVALUATION    ?eval.\n  ?paper         orkgp:HAS_BENCHMARK      ?benchmark.\n  OPTIONAL {?paper      orkgp:HAS_MODEL          ?model.\n            ?model      rdfs:label               ?model_lbl.}\n}"
            },
            "template_id": "T01",
            "auto_generated": true,
            "query_shape": "Tree",
            "query_class": "WHICH-WHAT",
            "number_of_patterns": 6
        },
        {
            "id": "AQ0913",
            "query_type": "Factoid",
            "question": {
                "string": "Can you list the metrics used to evaluate models on the WSC dataset?"
            },
            "paraphrased_question": [],
            "query": {
                "sparql": "SELECT DISTINCT ?metric ?metric_lbl\nWHERE {\n  ?dataset       a                orkgc:Dataset;\n                  rdfs:label       ?dataset_lbl.\n  FILTER (str(?dataset_lbl) = \"WSC\")\n  ?benchmark      orkgp:HAS_DATASET       ?dataset;\n                  orkgp:HAS_EVALUATION    ?eval.\n  OPTIONAL {?eval           orkgp:HAS_METRIC         ?metric.\n           ?metric          rdfs:label               ?metric_lbl.}\n}"
            },
            "template_id": "T03",
            "auto_generated": true,
            "query_shape": "Tree",
            "query_class": "WHICH-WHAT",
            "number_of_patterns": 6
        },
        {
            "id": "HQ0073",
            "query_type": "Factoid",
            "question": {
                "string": "Do all studies include open ocean sampling?"
            },
            "paraphrased_question": [
                "Is open ocean sampling involved in all contibutions?"
            ],
            "query": {
                "sparql": "ASK {\n  {\n    SELECT (COUNT(?ocean_sampling) AS ?counter)\n    WHERE {\n      orkgr:R155561 orkgp:compareContribution ?contrib.\n      ?contrib orkgp:P41379 ?ocean_sampling.\n      FILTER(?ocean_sampling = \"F\"^^xsd:string)\n    }\n  }\n  FILTER(?counter = 0)\n}"
            },
            "template_id": null,
            "auto_generated": false,
            "query_shape": "chain",
            "query_class": "BOOLEAN",
            "number_of_patterns": 2
        },
        {
            "id": "AQ0256",
            "query_type": "Factoid",
            "question": {
                "string": "What models are being evaluated on the Atari 2600 Freeway dataset?"
            },
            "paraphrased_question": [],
            "query": {
                "sparql": "SELECT DISTINCT ?model ?model_lbl\nWHERE {\n  ?dataset       a                orkgc:Dataset;\n                  rdfs:label       ?dataset_lbl.\n  FILTER (str(?dataset_lbl) = \"Atari 2600 Freeway\")\n  ?benchmark      orkgp:HAS_DATASET       ?dataset;\n                  orkgp:HAS_EVALUATION    ?eval.\n  ?paper         orkgp:HAS_BENCHMARK      ?benchmark.\n  OPTIONAL {?paper      orkgp:HAS_MODEL          ?model.\n            ?model      rdfs:label               ?model_lbl.}\n}"
            },
            "template_id": "T01",
            "auto_generated": true,
            "query_shape": "Tree",
            "query_class": "WHICH-WHAT",
            "number_of_patterns": 6
        },
        {
            "id": "AQ2013",
            "query_type": "Factoid",
            "question": {
                "string": "Can you provide links to code used in papers that benchmark the SciBERT (Base Vocab) model?"
            },
            "paraphrased_question": [],
            "query": {
                "sparql": "SELECT DISTINCT ?code\nWHERE {\n  ?model    a            orkgc:Model;\n            rdfs:label    ?model_lbl.\n  FILTER (str(?model_lbl) = \"SciBERT (Base Vocab)\")\n  ?benchmark      orkgp:HAS_DATASET        ?dataset.\n  ?cont           orkgp:HAS_BENCHMARK      ?benchmark.\n  ?cont           orkgp:HAS_MODEL          ?model;\n                  orkgp:HAS_SOURCE_CODE    ?code.\n}"
            },
            "template_id": "T07",
            "auto_generated": true,
            "query_shape": "Tree",
            "query_class": "WHICH-WHAT",
            "number_of_patterns": 4
        },
        {
            "id": "AQ1151",
            "query_type": "non-factoid",
            "question": {
                "string": "What is the top benchmark score and its metric on the SQuAD1.1 dataset?"
            },
            "paraphrased_question": [],
            "query": {
                "sparql": "SELECT DISTINCT ?metric ?metric_lbl (MAX(?value) AS ?score)\nWHERE {\n  {\n    SELECT ?metric ?metric_lbl ?value\n    WHERE {\n      ?dataset       a                orkgc:Dataset;\n                      rdfs:label       ?dataset_lbl.\n      FILTER (str(?dataset_lbl) = \"SQuAD1.1\")\n      ?benchmark      orkgp:HAS_DATASET       ?dataset;\n                      orkgp:HAS_EVALUATION    ?eval.\n      ?eval           orkgp:HAS_VALUE         ?value.\n      OPTIONAL {?eval           orkgp:HAS_METRIC         ?metric.\n               ?metric          rdfs:label               ?metric_lbl.}\n      ?cont         orkgp:HAS_BENCHMARK      ?benchmark.\n      OPTIONAL {?cont      orkgp:HAS_MODEL          ?model.\n                ?model      rdfs:label               ?model_lbl.}\n    }\n    ORDER BY DESC(?value)\n  }\n}\nGROUP BY ?metric ?metric_lbl"
            },
            "template_id": "T04",
            "auto_generated": true,
            "query_shape": "Tree",
            "query_class": "WHICH-WHAT",
            "number_of_patterns": 13
        },
        {
            "id": "AQ0706",
            "query_type": "Factoid",
            "question": {
                "string": "What are the metrics of evaluation over the ner_dataset_recognition dataset?"
            },
            "paraphrased_question": [],
            "query": {
                "sparql": "SELECT DISTINCT ?metric ?metric_lbl\nWHERE {\n  ?dataset       a                orkgc:Dataset;\n                  rdfs:label       ?dataset_lbl.\n  FILTER (str(?dataset_lbl) = \"ner_dataset_recognition\")\n  ?benchmark      orkgp:HAS_DATASET       ?dataset;\n                  orkgp:HAS_EVALUATION    ?eval.\n  OPTIONAL {?eval           orkgp:HAS_METRIC         ?metric.\n           ?metric          rdfs:label               ?metric_lbl.}\n}"
            },
            "template_id": "T03",
            "auto_generated": true,
            "query_shape": "Tree",
            "query_class": "WHICH-WHAT",
            "number_of_patterns": 6
        },
        {
            "id": "AQ1616",
            "query_type": "Factoid",
            "question": {
                "string": "What is the best performing model benchmarking the One Billion Word dataset in terms of Validation perplexity metric?"
            },
            "paraphrased_question": [],
            "query": {
                "sparql": "SELECT DISTINCT ?model ?model_lbl\nWHERE {\n  ?metric     a       orkgc:Metric;\n              rdfs:label  ?metric_lbl.\n  FILTER (str(?metric_lbl) = \"Validation perplexity\")\n  {\n    SELECT ?model ?model_lbl\n    WHERE {\n      ?dataset       a                orkgc:Dataset;\n                      rdfs:label       ?dataset_lbl.\n      FILTER (str(?dataset_lbl) = \"One Billion Word\")\n      ?benchmark      orkgp:HAS_DATASET       ?dataset;\n                      orkgp:HAS_EVALUATION    ?eval.\n      ?eval           orkgp:HAS_VALUE         ?value;\n                      orkgp:HAS_METRIC         ?metric.\n      ?cont         orkgp:HAS_BENCHMARK      ?benchmark;\n                    orkgp:HAS_MODEL          ?model.\n      ?model      rdfs:label               ?model_lbl.\n    }\n    ORDER BY DESC(?value)\n    LIMIT 1\n  }\n}"
            },
            "template_id": "T05",
            "auto_generated": true,
            "query_shape": "Tree",
            "query_class": "WHICH-WHAT",
            "number_of_patterns": 12
        }
    ]
}