{
    "questions": [
        {
            "id": "HQ0065",
            "query_type": "Factoid/Superlative",
            "question": {
                "string": "What is the maximum egg mass in studies?"
            },
            "paraphrased_question": [
                "What is the highest mass of embroyo eggs mentioned in the studies?"
            ],
            "query": {
                "sparql": "SELECT MAX(?egg_masses_float)\nWHERE {\n  orkgr:R34845 orkgp:compareContribution ?contrib.\n  ?contrib orkgp:P15692 ?egg_masses.\n  BIND(xsd:float(?egg_masses) AS ?egg_masses_float)\n}"
            },
            "template_id": null,
            "auto_generated": false,
            "query_shape": "chain",
            "query_class": "WHICH-WHAT",
            "number_of_patterns": 2
        },
        {
            "id": "AQ0174",
            "query_type": "Factoid",
            "question": {
                "string": "Can you list the models that have been evaluated on the DCASE dataset?"
            },
            "paraphrased_question": [],
            "query": {
                "sparql": "SELECT DISTINCT ?model ?model_lbl\nWHERE {\n  ?dataset       a                orkgc:Dataset;\n                  rdfs:label       ?dataset_lbl.\n  FILTER (str(?dataset_lbl) = \"DCASE\")\n  ?benchmark      orkgp:HAS_DATASET       ?dataset;\n                  orkgp:HAS_EVALUATION    ?eval.\n  ?paper         orkgp:HAS_BENCHMARK      ?benchmark.\n  OPTIONAL {?paper      orkgp:HAS_MODEL          ?model.\n            ?model      rdfs:label               ?model_lbl.}\n}"
            },
            "template_id": "T01",
            "auto_generated": true,
            "query_shape": "Tree",
            "query_class": "WHICH-WHAT",
            "number_of_patterns": 6
        },
        {
            "id": "AQ0054",
            "query_type": "Factoid",
            "question": {
                "string": "What are the models that have been benchmarked on the NYT dataset?"
            },
            "paraphrased_question": [],
            "query": {
                "sparql": "SELECT DISTINCT ?model ?model_lbl\nWHERE {\n  ?dataset       a                orkgc:Dataset;\n                  rdfs:label       ?dataset_lbl.\n  FILTER (str(?dataset_lbl) = \"NYT\")\n  ?benchmark      orkgp:HAS_DATASET       ?dataset;\n                  orkgp:HAS_EVALUATION    ?eval.\n  ?paper         orkgp:HAS_BENCHMARK      ?benchmark.\n  OPTIONAL {?paper      orkgp:HAS_MODEL          ?model.\n            ?model      rdfs:label               ?model_lbl.}\n}"
            },
            "template_id": "T01",
            "auto_generated": true,
            "query_shape": "Tree",
            "query_class": "WHICH-WHAT",
            "number_of_patterns": 6
        },
        {
            "id": "AQ0213",
            "query_type": "Factoid",
            "question": {
                "string": "Could you provide a list of models that have been tested on the Food-101 benchmark dataset?"
            },
            "paraphrased_question": [],
            "query": {
                "sparql": "SELECT DISTINCT ?model ?model_lbl\nWHERE {\n  ?dataset       a                orkgc:Dataset;\n                  rdfs:label       ?dataset_lbl.\n  FILTER (str(?dataset_lbl) = \"Food-101\")\n  ?benchmark      orkgp:HAS_DATASET       ?dataset;\n                  orkgp:HAS_EVALUATION    ?eval.\n  ?paper         orkgp:HAS_BENCHMARK      ?benchmark.\n  OPTIONAL {?paper      orkgp:HAS_MODEL          ?model.\n            ?model      rdfs:label               ?model_lbl.}\n}"
            },
            "template_id": "T01",
            "auto_generated": true,
            "query_shape": "Tree",
            "query_class": "WHICH-WHAT",
            "number_of_patterns": 6
        },
        {
            "id": "AQ0640",
            "query_type": "Factoid",
            "question": {
                "string": "What are the titles and IDs of research papers that include a benchmark for the BBCSport dataset?"
            },
            "paraphrased_question": [],
            "query": {
                "sparql": "SELECT DISTINCT ?paper ?paper_lbl\nWHERE {\n  ?dataset        a                orkgc:Dataset;\n                  rdfs:label       ?dataset_lbl.\n  FILTER (str(?dataset_lbl) = \"BBCSport\")\n  ?benchmark      orkgp:HAS_DATASET       ?dataset.\n  ?cont          orkgp:HAS_BENCHMARK      ?benchmark.\n  ?paper         orkgp:P31                ?cont;\n                 rdfs:label               ?paper_lbl.\n}"
            },
            "template_id": "T02",
            "auto_generated": true,
            "query_shape": "Tree",
            "query_class": "WHICH-WHAT",
            "number_of_patterns": 5
        },
        {
            "id": "AQ0198",
            "query_type": "Factoid",
            "question": {
                "string": "What models are being evaluated on the Cartpole, swingup (DMControl500k) dataset?"
            },
            "paraphrased_question": [],
            "query": {
                "sparql": "SELECT DISTINCT ?model ?model_lbl\nWHERE {\n  ?dataset       a                orkgc:Dataset;\n                  rdfs:label       ?dataset_lbl.\n  FILTER (str(?dataset_lbl) = \"Cartpole, swingup (DMControl500k)\")\n  ?benchmark      orkgp:HAS_DATASET       ?dataset;\n                  orkgp:HAS_EVALUATION    ?eval.\n  ?paper         orkgp:HAS_BENCHMARK      ?benchmark.\n  OPTIONAL {?paper      orkgp:HAS_MODEL          ?model.\n            ?model      rdfs:label               ?model_lbl.}\n}"
            },
            "template_id": "T01",
            "auto_generated": true,
            "query_shape": "Tree",
            "query_class": "WHICH-WHAT",
            "number_of_patterns": 6
        },
        {
            "id": "AQ0138",
            "query_type": "Factoid",
            "question": {
                "string": "Could you provide a list of models that have been tested on the Winograd Schema Challenge benchmark dataset?"
            },
            "paraphrased_question": [],
            "query": {
                "sparql": "SELECT DISTINCT ?model ?model_lbl\nWHERE {\n  ?dataset       a                orkgc:Dataset;\n                  rdfs:label       ?dataset_lbl.\n  FILTER (str(?dataset_lbl) = \"Winograd Schema Challenge\")\n  ?benchmark      orkgp:HAS_DATASET       ?dataset;\n                  orkgp:HAS_EVALUATION    ?eval.\n  ?paper         orkgp:HAS_BENCHMARK      ?benchmark.\n  OPTIONAL {?paper      orkgp:HAS_MODEL          ?model.\n            ?model      rdfs:label               ?model_lbl.}\n}"
            },
            "template_id": "T01",
            "auto_generated": true,
            "query_shape": "Tree",
            "query_class": "WHICH-WHAT",
            "number_of_patterns": 6
        },
        {
            "id": "AQ2180",
            "query_type": "Factoid",
            "question": {
                "string": "Where can I find code references in papers that have used the DEQ-Transformer (medium, adaptive embed) model for benchmarking purposes?"
            },
            "paraphrased_question": [],
            "query": {
                "sparql": "SELECT DISTINCT ?code\nWHERE {\n  ?model    a            orkgc:Model;\n            rdfs:label    ?model_lbl.\n  FILTER (str(?model_lbl) = \"DEQ-Transformer (medium, adaptive embed)\")\n  ?benchmark      orkgp:HAS_DATASET        ?dataset.\n  ?cont           orkgp:HAS_BENCHMARK      ?benchmark.\n  ?cont           orkgp:HAS_MODEL          ?model;\n                  orkgp:HAS_SOURCE_CODE    ?code.\n}"
            },
            "template_id": "T07",
            "auto_generated": true,
            "query_shape": "Tree",
            "query_class": "WHICH-WHAT",
            "number_of_patterns": 4
        },
        {
            "id": "AQ0875",
            "query_type": "Factoid",
            "question": {
                "string": "Can you list the metrics used to evaluate models on the BC5CDR dataset?"
            },
            "paraphrased_question": [],
            "query": {
                "sparql": "SELECT DISTINCT ?metric ?metric_lbl\nWHERE {\n  ?dataset       a                orkgc:Dataset;\n                  rdfs:label       ?dataset_lbl.\n  FILTER (str(?dataset_lbl) = \"BC5CDR\")\n  ?benchmark      orkgp:HAS_DATASET       ?dataset;\n                  orkgp:HAS_EVALUATION    ?eval.\n  OPTIONAL {?eval           orkgp:HAS_METRIC         ?metric.\n           ?metric          rdfs:label               ?metric_lbl.}\n}"
            },
            "template_id": "T03",
            "auto_generated": true,
            "query_shape": "Tree",
            "query_class": "WHICH-WHAT",
            "number_of_patterns": 6
        },
        {
            "id": "AQ0848",
            "query_type": "Factoid",
            "question": {
                "string": "What are the metrics of evaluation over the Cornell Grasp Dataset dataset?"
            },
            "paraphrased_question": [],
            "query": {
                "sparql": "SELECT DISTINCT ?metric ?metric_lbl\nWHERE {\n  ?dataset       a                orkgc:Dataset;\n                  rdfs:label       ?dataset_lbl.\n  FILTER (str(?dataset_lbl) = \"Cornell Grasp Dataset\")\n  ?benchmark      orkgp:HAS_DATASET       ?dataset;\n                  orkgp:HAS_EVALUATION    ?eval.\n  OPTIONAL {?eval           orkgp:HAS_METRIC         ?metric.\n           ?metric          rdfs:label               ?metric_lbl.}\n}"
            },
            "template_id": "T03",
            "auto_generated": true,
            "query_shape": "Tree",
            "query_class": "WHICH-WHAT",
            "number_of_patterns": 6
        },
        {
            "id": "AQ0468",
            "query_type": "Factoid",
            "question": {
                "string": "List the title and ID of research papers that contain a benchmark over the SQuAD2.0 dev dataset?"
            },
            "paraphrased_question": [],
            "query": {
                "sparql": "SELECT DISTINCT ?paper ?paper_lbl\nWHERE {\n  ?dataset        a                orkgc:Dataset;\n                  rdfs:label       ?dataset_lbl.\n  FILTER (str(?dataset_lbl) = \"SQuAD2.0 dev\")\n  ?benchmark      orkgp:HAS_DATASET       ?dataset.\n  ?cont          orkgp:HAS_BENCHMARK      ?benchmark.\n  ?paper         orkgp:P31                ?cont;\n                 rdfs:label               ?paper_lbl.\n}"
            },
            "template_id": "T02",
            "auto_generated": true,
            "query_shape": "Tree",
            "query_class": "WHICH-WHAT",
            "number_of_patterns": 5
        },
        {
            "id": "AQ2115",
            "query_type": "Factoid",
            "question": {
                "string": "Can you provide links to code used in papers that benchmark the Sandwich Transformer (adaptive span) model?"
            },
            "paraphrased_question": [],
            "query": {
                "sparql": "SELECT DISTINCT ?code\nWHERE {\n  ?model    a            orkgc:Model;\n            rdfs:label    ?model_lbl.\n  FILTER (str(?model_lbl) = \"Sandwich Transformer (adaptive span)\")\n  ?benchmark      orkgp:HAS_DATASET        ?dataset.\n  ?cont           orkgp:HAS_BENCHMARK      ?benchmark.\n  ?cont           orkgp:HAS_MODEL          ?model;\n                  orkgp:HAS_SOURCE_CODE    ?code.\n}"
            },
            "template_id": "T07",
            "auto_generated": true,
            "query_shape": "Tree",
            "query_class": "WHICH-WHAT",
            "number_of_patterns": 4
        },
        {
            "id": "AQ0135",
            "query_type": "Factoid",
            "question": {
                "string": "What models are being evaluated on the PIQA dataset?"
            },
            "paraphrased_question": [],
            "query": {
                "sparql": "SELECT DISTINCT ?model ?model_lbl\nWHERE {\n  ?dataset       a                orkgc:Dataset;\n                  rdfs:label       ?dataset_lbl.\n  FILTER (str(?dataset_lbl) = \"PIQA\")\n  ?benchmark      orkgp:HAS_DATASET       ?dataset;\n                  orkgp:HAS_EVALUATION    ?eval.\n  ?paper         orkgp:HAS_BENCHMARK      ?benchmark.\n  OPTIONAL {?paper      orkgp:HAS_MODEL          ?model.\n            ?model      rdfs:label               ?model_lbl.}\n}"
            },
            "template_id": "T01",
            "auto_generated": true,
            "query_shape": "Tree",
            "query_class": "WHICH-WHAT",
            "number_of_patterns": 6
        },
        {
            "id": "AQ1924",
            "query_type": "Factoid",
            "question": {
                "string": "List the code links in papers that use the Poolingformer model in any benchmark?"
            },
            "paraphrased_question": [],
            "query": {
                "sparql": "SELECT DISTINCT ?code\nWHERE {\n  ?model    a            orkgc:Model;\n            rdfs:label    ?model_lbl.\n  FILTER (str(?model_lbl) = \"Poolingformer\")\n  ?benchmark      orkgp:HAS_DATASET        ?dataset.\n  ?cont           orkgp:HAS_BENCHMARK      ?benchmark.\n  ?cont           orkgp:HAS_MODEL          ?model;\n                  orkgp:HAS_SOURCE_CODE    ?code.\n}"
            },
            "template_id": "T07",
            "auto_generated": true,
            "query_shape": "Tree",
            "query_class": "WHICH-WHAT",
            "number_of_patterns": 4
        },
        {
            "id": "HQ0018",
            "query_type": "Non-factoid",
            "question": {
                "string": "Which methods are used?"
            },
            "paraphrased_question": [
                "What are the methods used?",
                "Which methods are applied?"
            ],
            "query": {
                "sparql": "SELECT DISTINCT ?methods, ?methods_labels\nWHERE {\n  orkgr:R110361 orkgp:compareContribution ?cont.\n  ?cont orkgp:HAS_METHOD ?methods.\n  ?methods rdfs:label ?methods_labels.\n}"
            },
            "template_id": null,
            "auto_generated": false,
            "query_shape": "chain",
            "query_class": "WHICH-WHAT",
            "number_of_patterns": 3
        },
        {
            "id": "AQ0224",
            "query_type": "Factoid",
            "question": {
                "string": "Can you list the models that have been evaluated on the MLDoc Zero-Shot English-to-Chinese dataset?"
            },
            "paraphrased_question": [],
            "query": {
                "sparql": "SELECT DISTINCT ?model ?model_lbl\nWHERE {\n  ?dataset       a                orkgc:Dataset;\n                  rdfs:label       ?dataset_lbl.\n  FILTER (str(?dataset_lbl) = \"MLDoc Zero-Shot English-to-Chinese\")\n  ?benchmark      orkgp:HAS_DATASET       ?dataset;\n                  orkgp:HAS_EVALUATION    ?eval.\n  ?paper         orkgp:HAS_BENCHMARK      ?benchmark.\n  OPTIONAL {?paper      orkgp:HAS_MODEL          ?model.\n            ?model      rdfs:label               ?model_lbl.}\n}"
            },
            "template_id": "T01",
            "auto_generated": true,
            "query_shape": "Tree",
            "query_class": "WHICH-WHAT",
            "number_of_patterns": 6
        },
        {
            "id": "HQ0089",
            "query_type": "Factoid",
            "question": {
                "string": "Does FEEM Sustainability Index consider air quality?"
            },
            "paraphrased_question": [
                "Is air quality accounted for in the FEEM Sustainability Index?"
            ],
            "query": {
                "sparql": "ASK {\n  ?papers rdf:type orkgc:Paper.\n  ?papers rdfs:label ?papers_labels.\n  FILTER(REGEX(?papers_labels, \"FEEM Sustainability Index\"))\n  ?papers orkgp:P31 ?contrib.\n  ?contrib ?properties ?properties_values.\n  ?properties rdfs:label ?properties_labels.\n  FILTER(REGEX(?properties_labels, \"air quality\", \"i\"))\n  FILTER(?properties_values = \"yes\")\n}"
            },
            "template_id": null,
            "auto_generated": false,
            "query_shape": "tree",
            "query_class": "BOOLEAN",
            "number_of_patterns": 5
        },
        {
            "id": "AQ0108",
            "query_type": "Factoid",
            "question": {
                "string": "What models are being evaluated on the DROP Test dataset?"
            },
            "paraphrased_question": [],
            "query": {
                "sparql": "SELECT DISTINCT ?model ?model_lbl\nWHERE {\n  ?dataset       a                orkgc:Dataset;\n                  rdfs:label       ?dataset_lbl.\n  FILTER (str(?dataset_lbl) = \"DROP Test\")\n  ?benchmark      orkgp:HAS_DATASET       ?dataset;\n                  orkgp:HAS_EVALUATION    ?eval.\n  ?paper         orkgp:HAS_BENCHMARK      ?benchmark.\n  OPTIONAL {?paper      orkgp:HAS_MODEL          ?model.\n            ?model      rdfs:label               ?model_lbl.}\n}"
            },
            "template_id": "T01",
            "auto_generated": true,
            "query_shape": "Tree",
            "query_class": "WHICH-WHAT",
            "number_of_patterns": 6
        },
        {
            "id": "HQ0092",
            "query_type": "Factoid",
            "question": {
                "string": "Does ViCoMap support aggregation?"
            },
            "paraphrased_question": [
                "Can ViCoMap aggregate?"
            ],
            "query": {
                "sparql": "SELECT ?has_aggregation_support\nWHERE {\n  ?application rdfs:label \"ViCoMap\"^^xsd:string;\n               orkgp:P5038 ?has_aggregation_support_.\n  BIND(\n    IF(?has_aggregation_support_ = \"T\"^^xsd:string, \"yes\", \"no\")\n    AS ?has_aggregation_support\n  )\n}"
            },
            "template_id": null,
            "auto_generated": false,
            "query_shape": "star",
            "query_class": "WHICH-WHAT",
            "number_of_patterns": 2
        },
        {
            "id": "AQ1984",
            "query_type": "Factoid",
            "question": {
                "string": "Can you provide links to code used in papers that benchmark the SpanRel model?"
            },
            "paraphrased_question": [],
            "query": {
                "sparql": "SELECT DISTINCT ?code\nWHERE {\n  ?model    a            orkgc:Model;\n            rdfs:label    ?model_lbl.\n  FILTER (str(?model_lbl) = \"SpanRel\")\n  ?benchmark      orkgp:HAS_DATASET        ?dataset.\n  ?cont           orkgp:HAS_BENCHMARK      ?benchmark.\n  ?cont           orkgp:HAS_MODEL          ?model;\n                  orkgp:HAS_SOURCE_CODE    ?code.\n}"
            },
            "template_id": "T07",
            "auto_generated": true,
            "query_shape": "Tree",
            "query_class": "WHICH-WHAT",
            "number_of_patterns": 4
        },
        {
            "id": "AQ0303",
            "query_type": "Factoid",
            "question": {
                "string": "What models are being evaluated on the WOS-5736 dataset?"
            },
            "paraphrased_question": [],
            "query": {
                "sparql": "SELECT DISTINCT ?model ?model_lbl\nWHERE {\n  ?dataset       a                orkgc:Dataset;\n                  rdfs:label       ?dataset_lbl.\n  FILTER (str(?dataset_lbl) = \"WOS-5736\")\n  ?benchmark      orkgp:HAS_DATASET       ?dataset;\n                  orkgp:HAS_EVALUATION    ?eval.\n  ?paper         orkgp:HAS_BENCHMARK      ?benchmark.\n  OPTIONAL {?paper      orkgp:HAS_MODEL          ?model.\n            ?model      rdfs:label               ?model_lbl.}\n}"
            },
            "template_id": "T01",
            "auto_generated": true,
            "query_shape": "Tree",
            "query_class": "WHICH-WHAT",
            "number_of_patterns": 6
        },
        {
            "id": "AQ1157",
            "query_type": "non-factoid",
            "question": {
                "string": "What is the top benchmark score and its metric on the SearchQA dataset?"
            },
            "paraphrased_question": [],
            "query": {
                "sparql": "SELECT DISTINCT ?metric ?metric_lbl (MAX(?value) AS ?score)\nWHERE {\n  {\n    SELECT ?metric ?metric_lbl ?value\n    WHERE {\n      ?dataset       a                orkgc:Dataset;\n                      rdfs:label       ?dataset_lbl.\n      FILTER (str(?dataset_lbl) = \"SearchQA\")\n      ?benchmark      orkgp:HAS_DATASET       ?dataset;\n                      orkgp:HAS_EVALUATION    ?eval.\n      ?eval           orkgp:HAS_VALUE         ?value.\n      OPTIONAL {?eval           orkgp:HAS_METRIC         ?metric.\n               ?metric          rdfs:label               ?metric_lbl.}\n      ?cont         orkgp:HAS_BENCHMARK      ?benchmark.\n      OPTIONAL {?cont      orkgp:HAS_MODEL          ?model.\n                ?model      rdfs:label               ?model_lbl.}\n    }\n    ORDER BY DESC(?value)\n  }\n}\nGROUP BY ?metric ?metric_lbl"
            },
            "template_id": "T04",
            "auto_generated": true,
            "query_shape": "Tree",
            "query_class": "WHICH-WHAT",
            "number_of_patterns": 13
        },
        {
            "id": "AQ0104",
            "query_type": "Factoid",
            "question": {
                "string": "What models are being evaluated on the CUB-200-2011 dataset?"
            },
            "paraphrased_question": [],
            "query": {
                "sparql": "SELECT DISTINCT ?model ?model_lbl\nWHERE {\n  ?dataset       a                orkgc:Dataset;\n                  rdfs:label       ?dataset_lbl.\n  FILTER (str(?dataset_lbl) = \"CUB-200-2011\")\n  ?benchmark      orkgp:HAS_DATASET       ?dataset;\n                  orkgp:HAS_EVALUATION    ?eval.\n  ?paper         orkgp:HAS_BENCHMARK      ?benchmark.\n  OPTIONAL {?paper      orkgp:HAS_MODEL          ?model.\n            ?model      rdfs:label               ?model_lbl.}\n}"
            },
            "template_id": "T01",
            "auto_generated": true,
            "query_shape": "Tree",
            "query_class": "WHICH-WHAT",
            "number_of_patterns": 6
        },
        {
            "id": "AQ0044",
            "query_type": "Factoid",
            "question": {
                "string": "What models are being evaluated on the Pubmed dataset?"
            },
            "paraphrased_question": [],
            "query": {
                "sparql": "SELECT DISTINCT ?model ?model_lbl\nWHERE {\n  ?dataset       a                orkgc:Dataset;\n                  rdfs:label       ?dataset_lbl.\n  FILTER (str(?dataset_lbl) = \"Pubmed\")\n  ?benchmark      orkgp:HAS_DATASET       ?dataset;\n                  orkgp:HAS_EVALUATION    ?eval.\n  ?paper         orkgp:HAS_BENCHMARK      ?benchmark.\n  OPTIONAL {?paper      orkgp:HAS_MODEL          ?model.\n            ?model      rdfs:label               ?model_lbl.}\n}"
            },
            "template_id": "T01",
            "auto_generated": true,
            "query_shape": "Tree",
            "query_class": "WHICH-WHAT",
            "number_of_patterns": 6
        },
        {
            "id": "AQ0743",
            "query_type": "Factoid",
            "question": {
                "string": "Can you list the metrics used to evaluate models on the CoNLL04 dataset?"
            },
            "paraphrased_question": [],
            "query": {
                "sparql": "SELECT DISTINCT ?metric ?metric_lbl\nWHERE {\n  ?dataset       a                orkgc:Dataset;\n                  rdfs:label       ?dataset_lbl.\n  FILTER (str(?dataset_lbl) = \"CoNLL04\")\n  ?benchmark      orkgp:HAS_DATASET       ?dataset;\n                  orkgp:HAS_EVALUATION    ?eval.\n  OPTIONAL {?eval           orkgp:HAS_METRIC         ?metric.\n           ?metric          rdfs:label               ?metric_lbl.}\n}"
            },
            "template_id": "T03",
            "auto_generated": true,
            "query_shape": "Tree",
            "query_class": "WHICH-WHAT",
            "number_of_patterns": 6
        },
        {
            "id": "AQ2435",
            "query_type": "Factoid",
            "question": {
                "string": "Where can I find code references in papers that have used the BBG (ResNet-18) model for benchmarking purposes?"
            },
            "paraphrased_question": [],
            "query": {
                "sparql": "SELECT DISTINCT ?code\nWHERE {\n  ?model    a            orkgc:Model;\n            rdfs:label    ?model_lbl.\n  FILTER (str(?model_lbl) = \"BBG (ResNet-18)\")\n  ?benchmark      orkgp:HAS_DATASET        ?dataset.\n  ?cont           orkgp:HAS_BENCHMARK      ?benchmark.\n  ?cont           orkgp:HAS_MODEL          ?model;\n                  orkgp:HAS_SOURCE_CODE    ?code.\n}"
            },
            "template_id": "T07",
            "auto_generated": true,
            "query_shape": "Tree",
            "query_class": "WHICH-WHAT",
            "number_of_patterns": 4
        },
        {
            "id": "AQ0068",
            "query_type": "Factoid",
            "question": {
                "string": "What are the models that have been benchmarked on the DDI dataset?"
            },
            "paraphrased_question": [],
            "query": {
                "sparql": "SELECT DISTINCT ?model ?model_lbl\nWHERE {\n  ?dataset       a                orkgc:Dataset;\n                  rdfs:label       ?dataset_lbl.\n  FILTER (str(?dataset_lbl) = \"DDI\")\n  ?benchmark      orkgp:HAS_DATASET       ?dataset;\n                  orkgp:HAS_EVALUATION    ?eval.\n  ?paper         orkgp:HAS_BENCHMARK      ?benchmark.\n  OPTIONAL {?paper      orkgp:HAS_MODEL          ?model.\n            ?model      rdfs:label               ?model_lbl.}\n}"
            },
            "template_id": "T01",
            "auto_generated": true,
            "query_shape": "Tree",
            "query_class": "WHICH-WHAT",
            "number_of_patterns": 6
        },
        {
            "id": "AQ0200",
            "query_type": "Factoid",
            "question": {
                "string": "What models are being evaluated on the Cart Pole (OpenAI Gym) dataset?"
            },
            "paraphrased_question": [],
            "query": {
                "sparql": "SELECT DISTINCT ?model ?model_lbl\nWHERE {\n  ?dataset       a                orkgc:Dataset;\n                  rdfs:label       ?dataset_lbl.\n  FILTER (str(?dataset_lbl) = \"Cart Pole (OpenAI Gym)\")\n  ?benchmark      orkgp:HAS_DATASET       ?dataset;\n                  orkgp:HAS_EVALUATION    ?eval.\n  ?paper         orkgp:HAS_BENCHMARK      ?benchmark.\n  OPTIONAL {?paper      orkgp:HAS_MODEL          ?model.\n            ?model      rdfs:label               ?model_lbl.}\n}"
            },
            "template_id": "T01",
            "auto_generated": true,
            "query_shape": "Tree",
            "query_class": "WHICH-WHAT",
            "number_of_patterns": 6
        },
        {
            "id": "AQ0239",
            "query_type": "Factoid",
            "question": {
                "string": "What models are being evaluated on the Atari-57 dataset?"
            },
            "paraphrased_question": [],
            "query": {
                "sparql": "SELECT DISTINCT ?model ?model_lbl\nWHERE {\n  ?dataset       a                orkgc:Dataset;\n                  rdfs:label       ?dataset_lbl.\n  FILTER (str(?dataset_lbl) = \"Atari-57\")\n  ?benchmark      orkgp:HAS_DATASET       ?dataset;\n                  orkgp:HAS_EVALUATION    ?eval.\n  ?paper         orkgp:HAS_BENCHMARK      ?benchmark.\n  OPTIONAL {?paper      orkgp:HAS_MODEL          ?model.\n            ?model      rdfs:label               ?model_lbl.}\n}"
            },
            "template_id": "T01",
            "auto_generated": true,
            "query_shape": "Tree",
            "query_class": "WHICH-WHAT",
            "number_of_patterns": 6
        },
        {
            "id": "AQ1823",
            "query_type": "Factoid",
            "question": {
                "string": "What is the best performing model benchmarking the PWC Leaderboards (restricted) dataset in terms of Micro Recall metric?"
            },
            "paraphrased_question": [],
            "query": {
                "sparql": "SELECT DISTINCT ?model ?model_lbl\nWHERE {\n  ?metric     a       orkgc:Metric;\n              rdfs:label  ?metric_lbl.\n  FILTER (str(?metric_lbl) = \"Micro Recall\")\n  {\n    SELECT ?model ?model_lbl\n    WHERE {\n      ?dataset       a                orkgc:Dataset;\n                      rdfs:label       ?dataset_lbl.\n      FILTER (str(?dataset_lbl) = \"PWC Leaderboards (restricted)\")\n      ?benchmark      orkgp:HAS_DATASET       ?dataset;\n                      orkgp:HAS_EVALUATION    ?eval.\n      ?eval           orkgp:HAS_VALUE         ?value;\n                      orkgp:HAS_METRIC         ?metric.\n      ?cont         orkgp:HAS_BENCHMARK      ?benchmark;\n                    orkgp:HAS_MODEL          ?model.\n      ?model      rdfs:label               ?model_lbl.\n    }\n    ORDER BY DESC(?value)\n    LIMIT 1\n  }\n}"
            },
            "template_id": "T05",
            "auto_generated": true,
            "query_shape": "Tree",
            "query_class": "WHICH-WHAT",
            "number_of_patterns": 12
        },
        {
            "id": "AQ2114",
            "query_type": "Factoid",
            "question": {
                "string": "Can you provide links to code used in papers that benchmark the Feedback Transformer model?"
            },
            "paraphrased_question": [],
            "query": {
                "sparql": "SELECT DISTINCT ?code\nWHERE {\n  ?model    a            orkgc:Model;\n            rdfs:label    ?model_lbl.\n  FILTER (str(?model_lbl) = \"Feedback Transformer\")\n  ?benchmark      orkgp:HAS_DATASET        ?dataset.\n  ?cont           orkgp:HAS_BENCHMARK      ?benchmark.\n  ?cont           orkgp:HAS_MODEL          ?model;\n                  orkgp:HAS_SOURCE_CODE    ?code.\n}"
            },
            "template_id": "T07",
            "auto_generated": true,
            "query_shape": "Tree",
            "query_class": "WHICH-WHAT",
            "number_of_patterns": 4
        },
        {
            "id": "AQ0809",
            "query_type": "Factoid",
            "question": {
                "string": "What evaluation metrics are commonly used when benchmarking models on the CNN / Daily Mail dataset?"
            },
            "paraphrased_question": [],
            "query": {
                "sparql": "SELECT DISTINCT ?metric ?metric_lbl\nWHERE {\n  ?dataset       a                orkgc:Dataset;\n                  rdfs:label       ?dataset_lbl.\n  FILTER (str(?dataset_lbl) = \"CNN / Daily Mail\")\n  ?benchmark      orkgp:HAS_DATASET       ?dataset;\n                  orkgp:HAS_EVALUATION    ?eval.\n  OPTIONAL {?eval           orkgp:HAS_METRIC         ?metric.\n           ?metric          rdfs:label               ?metric_lbl.}\n}"
            },
            "template_id": "T03",
            "auto_generated": true,
            "query_shape": "Tree",
            "query_class": "WHICH-WHAT",
            "number_of_patterns": 6
        }
    ]
}